# SQL-6

### Functions and Triggers, and Rules

---
### Setup the environment

In [1]:
pip install ipython-sql psycopg2

Requirement already satisfied: ipython-sql in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (0.5.0)
Requirement already satisfied: psycopg2 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (2.9.10)
Requirement already satisfied: prettytable in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: ipython in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (8.31.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (2.0.37)
Requirement already satisfied: sqlparse in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: colorama in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

**Note** For this activity make sure to drop and create a new `cricdb` database. Run the following command from postgres commandline.

postgres# `drop database if exists cricdb;`

postgres# `create database cricdb;`

* Also make sure to shutdown or restart any kernels with active connection

In [3]:
%sql postgresql://postgres:070804@localhost:5432/cricdb

---

### A simple trigger

In [4]:
%sql drop table if exists player
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.
 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [5]:
%%sql create table player (
    player_id integer,
    first_name varchar(25),
    last_name varchar(25),
    dob date,
    team_id integer
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [6]:
%%sql create table team (
    team_id integer,
    team_name varchar(50),
    team_owner varchar(50)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [7]:
%%sql create or replace function add_dummy_team() returns trigger
as $example$
    begin
        insert into team values (NEW.team_id, 'dummy', 'dummy' );
        return NEW;
    end;
$example$ language plpgsql

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [8]:
%%sql create trigger example_trigger after insert on player
    for each row
    execute procedure add_dummy_team();

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [9]:
%sql select * from team;

 * postgresql://postgres:***@localhost:5432/cricdb
0 rows affected.

[]

In [10]:
%sql select * from player;

 * postgresql://postgres:***@localhost:5432/cricdb
0 rows affected.

[]

In [13]:
%%sql insert into player 
    values (1, 'Hardik', 'Pandya', '1993-10-11', 101);

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [14]:
%sql select * from team;

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(101, 'dummy', 'dummy'), (101, 'dummy', 'dummy')]

In [15]:
%sql select * from player;

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101)]

In [16]:
%%sql insert into player 
    values (2, 'MS', 'Dhoni', '1981-07-07', 101);

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

---

### Deleting a trigger

In [17]:
%sql drop trigger example_trigger on player;

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [18]:
%%sql insert into player 
    values (3, 'Rohit', 'Sharma', '1987-04-30', 101);

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

Q: check contents of relations `player` and `team`

In [19]:
%sql select * from team;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'dummy', 'dummy'), (101, 'dummy', 'dummy'), (101, 'dummy', 'dummy')]

---

### Example usecase: using functions and triggers to log (or audit)

In [20]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [21]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [22]:
%%sql create table player_log (
    player_id integer not null,
    team_id integer,
    last_op text,
    last_update timestamp with time zone,
    primary key(player_id, last_update)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [23]:
%%sql create or replace function add_to_player_log() returns trigger
as $$
    begin
        insert into player_log
            values (OLD.player_id, old.team_id, TG_OP, now());
        return new;
    end;
$$ language plpgsql

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [24]:
%%sql create trigger player_log_trigger after delete or update on player
    for each row
    execute procedure add_to_player_log();

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [25]:
%%sql insert into player 
    values (1, 'Hardik', 'Pandya', '1993-10-11', 101);

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [31]:
%sql select * from player_log

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(1, 101, 'UPDATE', datetime.datetime(2025, 1, 24, 10, 41, 24, 724305, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800)))),
 (1, 102, 'DELETE', datetime.datetime(2025, 1, 24, 10, 41, 32, 560710, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))))]

In [28]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101)]

In [29]:
%sql update player set team_id = 102

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [30]:
%sql delete from player where player_id = 1;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

---
### Notes on Event Triggers

```
create trigger example_trigger AFTER INSERT ON table_name
    for each row ...`
```

#### Type 
* insert
* delete
* update [of column_name[,...]]

#### Granularity
* for each row
* for each statement


#### When
* Before
* After


---
Q: Try out writing different triggers based on the above aspects and find out `how many times` does the function gets executed. (when does it gets called once and when many times?)

---
Q: What are some common use cases of triggers?

---
Q: What are some advantages and disadvantages of triggers?

---

In [32]:
%%sql insert into player 
    values (1, 'Hardik', 'Pandya', '1993-10-11', 101);
	values (1, 'Hardik', 'Pandya', '1993-10-11', 101);
	values (1, 'Hardik', 'Pandya', '1993-10-11', 101);

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.
1 rows affected.
1 rows affected.

[(1, 'Hardik', 'Pandya', '1993-10-11', 101)]

### Handling updates on views using event triggers

In [33]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [34]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [35]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [36]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [37]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [38]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [39]:
%%sql create view mi_players as
select player_id, first_name, last_name
from player join team on player.team_id = team.team_id
where team_name = 'Mumbai Indians';

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [40]:
%sql select * from mi_players;

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(1, 'Hardik', 'Pandya'), (3, 'Rohit', 'Sharma')]

In [41]:
%sql delete from mi_players where player_id = 1;

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.ObjectNotInPrerequisiteState) cannot delete from view "mi_players"
DETAIL:  Views that do not select from a single table or view are not automatically updatable.
HINT:  To enable deleting from the view, provide an INSTEAD OF DELETE trigger or an unconditional ON DELETE DO INSTEAD rule.

[SQL: delete from mi_players where player_id = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [42]:
%sql insert into mi_players values (5, 'Jasprit', 'Bhumra');

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.ObjectNotInPrerequisiteState) cannot insert into view "mi_players"
DETAIL:  Views that do not select from a single table or view are not automatically updatable.
HINT:  To enable inserting into the view, provide an INSTEAD OF INSERT trigger or an unconditional ON INSERT DO INSTEAD rule.

[SQL: insert into mi_players values (5, 'Jasprit' , 'Bhumra' );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

view is not updated because base table is not updated

In [43]:
%%sql create or replace function update_mi_players() returns trigger 
as $$
    begin 
        if (TG_OP = 'DELETE') then
            delete from player where player_id = OLD.player_id;
            if not found then return null; end if;
            return old;

        elsif (TG_OP = 'UPDATE') then
            update player set player_id = new.player_id 
                where first_name = old.first_name and last_name = old.last_name;
            if not found then return null; end if;
            return new;
        
        elsif (TG_OP = 'INSERT') then
            raise exception 'Cannnot insert into view as data of birth not known';
                
        end if;

    end;
$$ language plpgsql;

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [44]:
%%sql create trigger check_update_on_view
    instead of insert or update or delete on mi_players
    for each row execute function update_mi_players();

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [45]:
%sql delete from mi_players where player_id = 1;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [46]:
%sql select * from mi_players;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[(3, 'Rohit', 'Sharma')]

In [47]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

In [48]:
%sql insert into mi_players values (5, 'Jasprit', 'Bhumra');

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.RaiseException) Cannnot insert into view as data of birth not known
CONTEXT:  PL/pgSQL function update_mi_players() line 15 at RAISE

[SQL: insert into mi_players values (5, 'Jasprit' , 'Bhumra' );]
(Background on this error at: https://sqlalche.me/e/20/2j85)

In [49]:
%sql update mi_players set player_id = 5 where first_name = 'Rohit' and last_name = 'Sharma';

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

---
### Using Rules

In [50]:
%sql drop trigger if exists check_update_on_view on mi_players

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

Try inserting a tuple in the view again.

In [51]:
%%sql create or replace rule view_insert as on insert to mi_players
    do instead (
        insert into player values (new.player_id, new.first_name, new.last_name, '1988-01-01', 101);
    );

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [52]:
%sql insert into mi_players values (9, 'Jasprit', 'Bhumra');

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [53]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102),
 (5, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (9, 'Jasprit', 'Bhumra', datetime.date(1988, 1, 1), 101)]

In [54]:
%sql select * from mi_players;

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(5, 'Rohit', 'Sharma'), (9, 'Jasprit', 'Bhumra')]